# Используйте официальный образ Python как базовый
FROM python:3.9

# Установите рабочую директорию в контейнере
WORKDIR /usr/src/app

# Установите зависимости Python
# Скопируйте файл зависимостей в контейнер
COPY requirements.txt ./
# Установите зависимости из файла
RUN pip install --no-cache-dir -r requirements.txt

# Скопируйте остальную часть исходного кода вашего приложения в контейнер
COPY . .

# Сделайте порт 8000 доступным за пределами контейнера
EXPOSE 8000

# Запустите ваше Django-приложение
CMD ["python", "manage.py", "runserver", "0.0.0.0:8000"]